import { IAnimeTopList } from './AnimeTop.types.ts';

export const AnimeTopList: IAnimeTopList = {
  list: [
    {
      title: 'Звёздное дитя',
      image: 'https://external-preview.redd.it/oshi-no-ko-season-2-anime-is-confirmed-to-have-13-episodes-v0-D_NCD0nQuFtXhpuNKQO1M_-IxrEpZnjhkdLhl0B-lbA.jpg?width=1080&crop=smart&auto=webp&s=f1fb072163b7f141af16b85856946c8d5a55b004',
      link: 'oshi-no-ko-2',
      description: 'Наблюдая за выступлениями актёров на экранах телевизоров может показаться, что быть знаменитостью легко и весело. Однако за кулисами между актёрами нередко разгораются настоящие интриги, серьёзные противостояния и ожесточённые состязания. Во втором сезоне нашим героям предстоит сыграть в театральной постановке манги "Токийский клинок". Вместе с ними мы узнаем о секретах театра Лалалай, о том, что главная битва может идти не между персонажами, а между самими актёрами, а также о тайнах, мастерски сокрытых долгими годами притворства и лжи.',
      id: 1
    },
    {
      title: 'Клинок, рассекающий демонов: Тренировка столпов',
      image: 'https://desu.shikimori.one/system/screenshots/original/9b7828118fbdb019747befbcf2fc2e07b6230c09.jpg?1715705951',
      link: 'kimetsu-no-yaiba-hashira-geiko-hen',
      description: 'Инцидент в Деревне кузнецов завершился, и его последствия могут оказаться судьбоносными для Японии. Собравшись на срочное совещание, столпы, обсудив текущую ситуацию, приходят к заключению, что нынешние охотники на демонов слишком слабы, чтобы оказывать достойное сопротивление Молодым лунам. Такое положение дел чревато большими человеческими потерями и может поставить под угрозу существование самой организации.',
      id: 2
    },
    {
      title: 'Борьба в прямом эфире',
      image: 'https://media.myshows.me/shows/760/a/f1/af17996b5c74a25122685f4584d8dd3b.jpg',
      link: 'kenka-dokugaku',
      description: 'Ещё недавно над тощим и хилым старшеклассником Ю Хобином постоянно издевались его ровесники-отморозки, которые чувствовали над ним превосходство. Кто бы тогда подумал, что он станет успешным видеоблогером, канал которого будет посвящён не каким-нибудь там играм или фильмам, а боевым искусствам! А подняться парню помогла удача: его случайно загруженное видео завирусилось, и к нему тут же пришли слава и популярность. Вот только удержать внимание подписчиков непросто! Чтобы делать увлекательный контент, ему предстоит и правда научиться драться. Благо с мотивацией у парня всё в порядке: запах денег и жажда популярности способны творить настоящие чудеса.',
      id: 3
    }
  ],
}


